In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [8]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [9]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [10]:
%%sql
create database db_project;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [11]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[('db_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [12]:
%%sql
use db_project;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [13]:
%%sql
create table sample (sno int, name varchar{50});

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'varchar50)' at line 1
[SQL: create table sample (sno int, name varchar50);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [14]:
%%sql
create table sample (sno int, name varchar(50));

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [15]:
%%sql
insert into sample (sno ,name) values (1 ,prasanth);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1054 (42S22): Unknown column 'prasanth' in 'field list'
[SQL: insert into sample (sno ,name) values (1 ,prasanth);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [18]:
%%sql
insert into sample (sno ,name) values (2 ,'master');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [19]:
%%sql
select * from sample;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'prasanth'), (2, 'master')]

In [22]:
%%sql
update sample set name = "T.prasanth",sno = 4 where sno =1;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [23]:
%%sql
select * from sample;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(4, 'T.prasanth'), (2, 'master')]

In [26]:
%%sql
delete from sample where sno=4;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [32]:
%%sql
select * from sample;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(2, 'master')]

In [29]:
%%sql
alter table sample rename column sno to s.no;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '.no' at line 1
[SQL: alter table sample rename column sno to s.no;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [31]:
%%sql
alter table sample rename column sno to s_no;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [34]:
%%sql
create table employees (
    employee_id int primary key,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [44]:
%%sql
create table high_paid_employees as 
select
    employee_id,
    first_name,
    last_name,
    salary
from employees
where salary > 60000;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [51]:
%%sql
create temporary table temp_paid_high_employees (
    employee_id int,
    salary decimal(10,2)
);
insert into temp_paid_high_employees 
select
employee_id,
salary 
from employees 
where salary > 60000;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
with high_salary_cte as (
    select employee_id,first_name,last_name,salary 
    from employees
    where salary > 70000
)
create table high_salary_employees_via_cte
select * from high_salary_cte;

In [4]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[('db_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]